x = [11, 39, 23, 24, 5, 1, 27, 31, 55, 37, 13, 45, 93, 36, 24, 31, 40, 99, 29, 77, 55, 19, 15, 35, 88, 94, 5, 47, 63, 69, 90, 3, 23, 87, 97, 79, 86, 90, 89, 40, 70, 0, 8, 99, 55, 56, 71, 71, 45, 2, 24, 30, 59, 10, 9, 1, 7, 19, 12, 24, 62, 93, 5, 16, 12, 64, 64, 80, 71, 10, 46, 66, 22, 40, 68, 18, 58, 2, 24, 92, 71, 49, 5, 33, 74, 42, 6, 7, 76, 100, 63, 82, 32, 60, 25, 35, 83, 18, 72, 10, -3]

biggi = 0 
# max
for x1 in x : 

    if biggi < x1 :
        biggi = x1

print(biggi)


biggi = 100 
# min
for x1 in x : 

    if biggi > x1 :
        biggi = x1

print(biggi)

# //////////////////////////////////////////////////////////////////

spisokimen = [
    "Python",
    "Программирование",
    "Код",
    "Переменная",
    "Функция",
    "Модуль",
    "Пакет",
    "Класс",
    "Объект",
    "Наследование",
    "Полиморфизм",
    "Список",
    "Кортеж",
    "Множество",
    "Словарь",
    "Цикл",
    "Условие",
    "Исключение",
    "Отладка",
    "Компиляция",
    "Интерпретатор",
    "API",
    "Библиотека",
    "Среда разработки",
    "Git",
    "PyPI",
    "Flask",
    "Django",
    "Pandas",
    "NumPy",
    "Matplotlib",
    "SciPy",
    "TensorFlow",
    "Keras",
    "Обработка данных",
    "Машинное обучение",
    "Искусственный интеллект",
    "Веб-разработка",
    "GUI",
    "Асинхронный",
    "Поток",
    "Многопоточность",
    "Синхронизация",
    "Документация",
    "Аннотация",
    "Сериализация",
    "JSON",
    "CSV",
    "Регулярные выражения",
    "Тестирование"
]

# ### Объяснение работы:
# - Программа инициализирует переменную со значением `"random"`.
# - Затем проходит по каждому элементу списка и заменяет `korotkoe` на текущее слово, если оно короче предыдущего значения.
# - В итоге, программа выводит самое короткое слово из списка. 



korotkoe = "random"

for y2 in spisokimen: 

    if len(korotkoe) > len(y2) :
        korotkoe = y2


# //////////////////////////////////////////////////////////////////


print(korotkoe)
km = int(input( "число"))

skolkoproehali = 0
while km > skolkoproehali :
    print(skolkoproehali, km-skolkoproehali)
    skolkoproehali +=5

rar = 0 
while 2 > 1 :
    print("yep")
    rar += 1
    if rar == 5:
        break 


# //////////////////////////////////////////////////////////////////

umniyspisok = []

while True :
    zakaz = input( "write here")
    
    if zakaz == "0" :
        print(umniyspisok)
        break
    umniyspisok.append(zakaz)